//
//  Data Manager.swift
//  MovieForYou
//
//  Created by MAC  on 02.04.2022.
//

import Foundation

class DataManager {
    
    let allComedyMovies = [
    "Впритык" : "Мальчишник в Вегасе",
    "Большой Лебовски" : "Евротур",
    "Зависнуть в Палм-Спрингс" : "Отель Гранд Будапешт",
    "Борат" : "Волк с Уолл-Стрит",
    "Главный герой" : "Всегда говори да",
    "Не смотрите наверх" : "Телохранитель киллера",
    "Одноклассники" : "Почему он",
    "Мой парень псих" : "Дедушка легкого поведения",
    "Несносные боссы" : "Безбрачная неделя",
    "Холоп" : "Последний богатырь"
    ]
    
    let allActionMovies = [
    "Безумный Макс" : "Миссия невыполнима",
    "Апгрейд" : "Джон Уик",
    "Хардкор" : "Драйв",
    "Неудержимые" : "Заложница",
    "Олдбой" : "Убить Билла",
    "Перевозчик" : "Идентификация Борна",
    "Отчаянный" : "Терминатор",
    "Крепкий орешек" : "Матрица",
    "Гнев человеческий" : "Бесславные ублюдки",
    "Кингсмен" : "Мистер и миссис Смит"
    ]
    
    let allThrillersMovies = [
    "Адвокат дьявола" : "Девушка с татуировкой дракона",
    "Игра в иммитацию" : "Исчезнувшая",
    "Молчание ягнят" : "Невидимый гость",
    "Области тьмы" : "Остров проклятых",
    "Отступники" : "Престиж",
    "Семь" : "Счастливое число Слевина",
    "Бойцовский клуб" : "Лучшее предложение",
    "Сплит" : "Сонная лощина",
    "Зодиак" : "Сияние",
    "Пленницы" : "Код Да Винчи"
    ]
}

