//
//  Data Manager.swift
//  MovieForYou
//
//  Created by MAC  on 02.04.2022.
//

import Foundation

class DataManager {
    
    let allComedyMovies = [
    "Впритык" : "Мальчишник в Вегасе",
    "Отель Гранд Будапешт" : "Евротур",
    "Зависнуть в Палм-Спрингс" : "Мальчишник в Вегасе",
    "Борат" : "Волк с Уолл-Стрит",
    "Телохранитель киллера" : "Всегда говори да",
    "Не смотрите наверх" : "Волк с Уолл-Стрит",
    "Одноклассники" : "Безбрачная неделя",
    "Почему он" : "Дедушка легкого поведения",
    "Несносные боссы" : "Безбрачная неделя",
    "Холоп" : "Евротур"
    ]
    
    let allActionMovies = [
    "Миссия невыполнима" : "Терминатор",
    "Бесславные ублюдки" : "Счастливое число Слевина",
    "Хардкор" : "Убить Билла",
    "Неудержимые" : "Заложница",
    "Джон Уик" : "Убить Билла",
    "Перевозчик" : "Счастливое число Слевина",
    "Идентификация Борна" : "Терминатор",
    "Мистер и миссис Смит" : "Убить Билла",
    "Матрица" : "Убить Билла",
    "Кингсмен" : "Заложница"
    ]
    
    let allThrillersMovies = [
    "Адвокат дьявола" : "Игры разума",
    "Игра в иммитацию" : "Исчезнувшая",
    "Молчание ягнят" : "Невидимый гость",
    "Области тьмы" : "Остров проклятых",
    "Отступники" : "Престиж",
    "Семь" : "Счастливое число Слевина",
    "Остров проклятых" : "Лучшее предложение",
    "Сплит" : "Сонная лощина",
    "Зодиак" : "Сияние",
    "Пленницы" : "Код Да Винчи"
    ]
}
